--teamtask:表示是哪种类型的chat，每条配置前面都需要加
AutoChatInI={
"Tdairen2_PreTime=300",						--每次自动私聊间隔时间(此字段名字不要变化，如有变换要通知服务器)
"Tdairen2_MaxCount=5",						--每种类型发送条数上限(此字段名字不要变化，如有变换要通知服务器)
"Tdairen2_以后有什么不懂得来找我哇，嘿嘿，我尽量帮助你@!",	--私聊内容不要超过60个汉字，下同
"Tdairen2_Yo,不错哦，装备还蛮好的嘛，加油加油",			--私聊内容不要超过60个汉字，下同
"Tdairen2_哇咔咔，快快升级，咱们好拿经验@!",			--私聊内容不要超过60个汉字，下同
"Tdairen2_统一不错，和我一起一直玩下去吧@!",
"Tdarren2_Come On Baby，爱死你了，快去升级吧，经验哟@A",
"Tdarren2_你好我也好，经验多多，大家好@A" ,
"Tdarren2_知道吗，我灰常灰常的爱你，神马都是浮云，因为你是我的经验书，升级到15级咱们就能够去领取经验了哦@>"  ,
"Tdarren2_风在吼，马在叫，经验马上就要来了，咱们的目标15级@)",
"Tdarren2_呼啦啦，哈嘻嘻，我看到经验在飞，15级的时候我们就可以去领经验了哦@#" ,
"Tdarren2_无兄弟，不统一，咱们以后是好朋友啦。" ,
"Tdarren2_我喜欢统一，以后咱们一起笑傲江湖吧。"  ,
"Tdairen3_PreTime=300",
"Tdairen3_MaxCount=5",
"Tdairen3_以后有什么不懂得来找我哇，嘿嘿，我尽量帮助你@!",--不要超过60个汉字
"Tdairen3_Yo,不错哦，装备还蛮好的嘛，加油加油",--不要超过60个汉字
"Tdairen3_哟西，快快升级，咱们好拿经验@!",--不要超过60个汉字
"Tdairen3_统一不错，和我一起一直玩下去吧@!",
"Tdarren3_Come On Baby，爱死你了，快去升级吧，经验哟@A"  ,
"Tdarren3_你好我也好，经验多多，大家好@A" ,
"Tdarren3_知道吗，我灰常灰常的爱你，神马都是浮云，因为你是我的经验书，升级到20级打完BOSS咱们就能够去领取经验了哦@>" ,
"Tdarren3_风在吼，马在叫，经验马上就要来了，咱们的目标20级和王凝之处的BOSS任务哦@)"  ,
"Tdarren3_呼啦啦，哈嘻嘻，我看到经验在飞，20级的时候去打完BOSS我们就可以去领经验了哦@#"    ,
"Tdarren3_无兄弟，不统一，咱们以后是好朋友啦。"  ,
"Tdarren3_我喜欢统一，以后咱们一起笑傲江湖吧。"    ,
"Tdarren3_打BOSS的时候叫我哦，我去帮你打，嘿嘿。"  ,
"Tdairen4_PreTime=300",
"Tdairen4_MaxCount=5",
"Tdairen4_以后有什么不懂得来找我哇，嘿嘿，我尽量帮助你@!",--不要超过60个汉字
"Tdairen4_Yo,不错哦，装备还蛮好的嘛，加油加油",--不要超过60个汉字
"Tdairen4_哇咔咔，快快升级，咱们好拿经验@!",--不要超过60个汉字
"Tdairen4_统一不错，和我一起一直玩下去吧@!",
"Tdarren4_Come On Baby，爱死你了，快去升级吧，经验哟@A" ,
"Tdarren4_你好我也好，经验多多，大家好@A" ,
"Tdarren4_知道吗，我灰常灰常的爱你，神马都是浮云，因为你是我的经验书，升级到25级收集2份精品鱼肉咱们就能够去领取经验了哦@>" ,
"Tdarren4_风在吼，马在叫，经验马上就要来了，咱们的目标25级和收集2份精品鱼肉@)" ,
"Tdarren4_呼啦啦，哈嘻嘻，我看到经验在飞，25级的时候拿2份精品鱼肉我们就可以去领经验了哦@#" ,
"Tdarren4_无兄弟，不统一，咱们以后是好朋友啦。" ,
"Tdarren4_我喜欢统一，以后咱们一起笑傲江湖吧。" ,
"Tdairen5_PreTime=300",
"Tdairen5_MaxCount=5",
"Tdairen5_以后有什么不懂得来找我哇，嘿嘿，我尽量帮助你@!",--不要超过60个汉字
"Tdairen5_Yo,不错哦，装备还蛮好的嘛，加油加油",--不要超过60个汉字
"Tdairen5_哇塞，快快升级，咱们好拿经验@!",--不要超过60个汉字
"Tdairen5_统一不错，和我一起一直玩下去吧@!",
"Tdarren5_Come On Baby，爱死你了，快去升级吧，经验哟@A"  ,
"Tdarren5_你好我也好，经验多多，大家好@A" ,
"Tdarren5_知道吗，我灰常灰常的爱你，神马都是浮云，因为你是我的经验书，升级到30级完成鏖战万蛇[BOSS]任务咱们就能够去领取经验了哦@>"  ,
"Tdarren5_风在吼，马在叫，经验马上就要来了，咱们的目标30级和朱序那里的鏖战万蛇[BOSS]任务@)" ,
"Tdarren5_呼啦啦，哈嘻嘻，我看到经验在飞，30级的时候完成朱序处鏖战万蛇[BOSS]任务我们就可以去领经验了哦@#" ,
"Tdarren5_无兄弟，不统一，咱们以后是好朋友啦。"  ,
"Tdarren5_我喜欢统一，以后咱们一起笑傲江湖吧。"   ,
}