--[[BUFFINFO={
id=401,
icon=80,
name="暴击",
shoot=100,
victimsay="@A已经进入暴击状态,攻击力提供了很多.", 
mesay="您已经进入暴击状态,攻击力已大幅提高.", 
dieclear=1,
}
BUFFEFFECT={
time_last="30|30|30|30|30|30|30|30|30",
att="15|20|25|30|35|40|45|50|55",
}]]
---buff测试脚本1：增益状态、瞬时状态

BUFFINFO={
id=401,							--BUFFID
icon=80,						--BUFF图标
name="暴击",						--BUFF 名称
shoot=100,						--命中率		
victimsay="@A已经进入暴击状态,攻击力提供了很多.",	--被命中人所见到的说明
mesay="您已经进入暴击状态,攻击力已大幅提高.",		--自身说明
dieclear=1,						--0为死亡后不清除，1为死亡后清除					
--**新增**--
--extraly_damage="15|20|25|30|35|40|45|50|55",		--攻击的瞬间额外伤害百分比
bufftype=1,						--状态类型：1增益 2减益
--immune="443|444",--免疫状态，即拥有本buff时，该字段所填的buff是无效的；无免疫状态	
}
BUFFEFFECT={
time_last="30|30|30|30|30|30|30|30|30",			--技能等级持续时间					
--att="15|20|25|30|35|40|45|50|55",			--攻击增长
HP="-300000|-500000|-700000|-900000|-1100000|-1400000|-1700000|-2000000|-2300000",  --大于3位数，除以1000，否则，百分比
}