SKILLINFO = {
name= "弱甲",
long= "单体技能，降低对象防御力$DEF%,对普通怪物无效",
id=103,
itype=1,
bin=24,
job=1,
max_level= 9,
knowledge= 1,
icon=71,
isac=1,
area=81,
roleAni=7,-------------------注意动作中5、6、7的区别用法
addr=2,
needsk="102|2",
}

EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",
Skill="3|4|5|6|7|8|9|10|11",
MP="41|63|85|118|149|179|206|233|254",
learn="12|14|17|21|25|29|33|37|41",
tr_state="404",
}