SKILLINFO = {
name= "以命搏命",
long= "敌我双方一起失去$SJHP点生命",--瞬间加血和掉血，用SJHP
id=106,
--bin=14,--无14这个技能特效
itype=1,
job=1,  
max_level= 9,
knowledge= 1,
icon=75,
isac=1,
area=45,
roleAni=27,
addr=5,
needsk="105|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="3400|3400|3400|3400|3400|3400|3400|3400|3400",
limit2="3300|3300|3300|3300|3300|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="68|85|108|138|167|194|220|241|262",
learn="34|36|38|40|42|44|46|48|50",
tr_state="505",--敌对掉血
me_state="505",--自身掉血——现在调用1个，属于等量换血，如果不等量，需要2个buff
}