SKILLINFO = {
name= "战神归位",
long= "力量提升$STR，持续$LASTTIME秒",
id=111,
--bin=17,--没效果，4个人影回到本体，闪几下~。
job=1,  
max_level= 9,
knowledge= 1,
icon=66,
isac=0,
area=1,
roleAni=27,
addr=10,
needsk="110|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="80000|80000|80000|80000|80000|80000|80000|80000|80000",
limit2="3500|3500|3500|3500|3500|1700|1700|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="132|165|195|224|251|273|295|301|301",
learn="36|38|40|42|44|46|48|50|52",
me_state="405",
}