SKILLINFO = {
name= "回光返照",
long= "在$LASTTIME秒内，受到的伤害，全部转化为自身生命",
id=112,
bin=29,
job=1,  
max_level= 9,
knowledge= 1,
icon=60,
isac=0,
area=1,
roleAni=4,
addr=11,
needsk="111|6",--技能错开后，修改前置条件
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="180000|170000|160000|150000|140000|130000|120000|110000|100000",
limit2="3500|3500|3500|3500|3500|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="125|156|186|214|241|269|290|296|296",
learn="45|47|49|51|53|55|57|59|61",
me_state="513",
}