SKILLINFO = {
name= "嘲讽",
long= "让周围玩家强制攻击自己1次,对普通怪物无效",
id=113,
--itype=1,
job=1,
max_level= 9,
knowledge= 1,
icon=68,
isac=1,
area=150,
roleAni=25,
addr=12,
spskill =1, --代表是“嘲讽”
needsk="108|3",
movebuff=1,--移除目标增益状态
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="50000|50000|50000|50000|50000|50000|50000|50000|50000",
limit2="3200|3200|3200|3200|3200|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="70|120|190|230|350|450|550|650|800",
learn="22|24|26|28|30|32|34|36|38",
hit="10|20|30|40|50|60|70|80|90",
me_state="515",
tr_state="562",
}