SKILLINFO = {
name= "反弹",
long= "一定时间内，任何对您造成伤害的敌人都会遭受一定程度的反噬！普通攻击100%概率反弹，技能攻击一定概率反弹！",
id=116,
job=1,
bin=28,
max_level= 9,
knowledge= 1,
icon=65,
isac=0,
area=1,
roleAni=25,
addr=15,
needsk="115|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="60000|60000|60000|60000|60000|60000|60000|60000|60000",
limit2="3500|3500|3500|3500|3500|1800|1800|900|900",
Skill="3|4|5|6|7|8|9|10|11",
MP="110|135|152|183|213|240|267|295|316",
learn="38|40|42|44|46|48|50|52|54",
me_state="429",
}