SKILLINFO = {
name= "虚弱",
long= "降低目标攻击$ATT%，防御$DEF%，持续$LASTTIME秒,对普通怪物无效",
id=123,
bin=24,
itype=1,
job=3, 
max_level= 9,
knowledge= 1,
icon=71,
isac=1,
area=81,
roleAni=7,
addr=2,
needsk="122|2",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="20000|20000|20000|20000|20000|20000|20000|20000|20000",
limit2="3200|3200|3200|3200|3200|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="12|14|17|21|25|29|33|37|41",
tr_state="501",-----降低目标攻击和防御
}