SKILLINFO = {
name= "刺杀",
long= "单体攻击技能,造成$SJHP的额外伤害.",--瞬间加血和掉血，用SJHP
id=124,
itype=1,
job=3, 
max_level= 9,
knowledge= 1,
icon=21,
isac=1,
area=81,
roleAni=21,
addr=3,
needsk="123|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="20|23|26|29|32|35|38|41|44",
hit="90|110|140|180|230|330|450|580|750",
tr_state="516",
}