SKILLINFO = {
name= "折光",
long= "形成一层折光外壳，总共能抵挡$XISHOU的伤害，持续$LASTTIME秒",
id=128,
--bin=14,
itype=0,
job=3, 
max_level= 9,
knowledge= 1,
icon=63,
isac=0,
area=5,
roleAni=27,
addr=7,
needsk="123|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="50000|50000|50000|50000|50000|50000|50000|50000|50000",--技能限制时间
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",--技能释放时间
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="15|18|21|24|27|30|33|36|39",
me_state="514",
}