--待测试
SKILLINFO = {
name= "乾坤一剑",
long= "当目标生命低于百分之$HPEX时，受到$HPEXDAMAGE的更大伤害,对普通怪物无效",
id=136,
bin=21,
itype=1,
job=3, 
max_level= 9,
knowledge= 1,
icon=74,
isac=1,
area=81,
roleAni=21,
addr=15,
hpex=-40,--目标血量低于40%时，受到的伤害加大；负数为小于，正数为大于
needsk="135|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="30000|30000|30000|30000|30000|30000|30000|30000|30000",
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="38|40|42|44|46|48|50|52|54",
hit="90|110|140|180|230|330|450|580|750",--正常伤害
hpexdamage="90|110|120|120|170|270|350|420|450",--血量低于40%，收到的额外伤害
}
