SKILLINFO = {             ----150开始为体验技能所用
name= "威力四射",
long= "范围攻击技能.",
id=150,--技能所属职业填写1为战士,填写2为谋士,填写3为侠客,填写0为所有职业  
bin=17,
itype=1,-- 数字 1是攻击型,没有此字段是辅助性
job=0,  
max_level= 9,
knowledge= 1,
icon=57,
isac=1,--技能目标,自己（自己队伍）(0),其他（其他队伍）(1),所有人(2)
area=80,--技能攻击范围+单体全体.个位奇数表示单体,偶数表示群体.
roleAni=13,
addr=1,
}
EFFECTINFO = {
money="0|0|0|0|0|2000|5000|8000|11000",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",
Skill="0|22|34|48|70|92|114|136|158",
MP="40|45|58|75|95|150|250|350|500",
learn="1|10|13|15|17|19|21|23|25",
hit="1|1|1|110|160|230|300|370|450",
}