SKILLINFO = {
name= "金钟罩",
long= "辅助技能,增加小范围内队伍防御力$DEF点,持续时间为$LASTTIME秒.解除冰冻状态.",
id=153,
bin=1,
job=1,  
max_level= 9,
knowledge= 1,
icon=60,
isac=0,
area=20,
roleAni=13,
addr=4,
needsk="104|1",
}
EFFECTINFO = {
money="0|0|0|0|0|2000|5000|8000|11000",
limit1="50000|50000|50000|50000|50000|50000|50000|50000|50000",
limit2="3700|3700|3700|3700|3700|1800|1800|900|900",
Skill="31|43|59|81|103|125|147|167|179",
MP="86|104|128|160|191|219|246|269|290",
learn="13|16|18|20|22|24|26|28|30",
tr_state="403",
}