SKILLINFO = {
name= "反弹",
long= "单体辅助技能,使本身具有自动反弹$RESISTDAMAGE%伤害给对方的效果,持续时间$LASTTIME秒,几率为$SHOOT%.",
id=155,
bin=2,
job=1,  
max_level= 9,
knowledge= 1,
icon=65,
isac=0,
area=0,
roleAni=13,
addr=10,
needsk="108|1",
}
EFFECTINFO = {
money="0|0|0|0|0|2000|5000|8000|11000",
limit1="60000|60000|60000|60000|60000|60000|60000|60000|60000",
limit2="4200|4200|4200|4200|4200|2100|2100|1000|1000",
Skill="72|94|116|138|160|176|190|196|200",
MP="130|163|195|224|252|278|300|303|306",
learn="26|28|30|31|32|33|34|35|35",
tr_state="429",
}