SKILLINFO = {
name= "无敌",
long= "单体辅助技能,使自己在$LASTTIME秒内无敌而不被伤害HP,每10秒耗费MP$MP点.对诅咒和昏睡免疫.",
id=156,
bin=3,
job=1,  
max_level= 9,
knowledge= 1,
icon=66,
isac=0,
area=0,
roleAni=13,
addr=7,
needsk="109|1",
}
EFFECTINFO = {
money="0|0|0|0|0|2000|5000|8000|11000",
limit1="60000|60000|60000|60000|60000|60000|60000|60000|60000",
limit2="3500|3500|3500|3500|3500|1700|1700|800|800",
Skill="77|99|121|143|165|179|193|199|201",
MP="132|165|195|224|251|273|295|301|301",
learn="27|29|30|31|32|33|34|35|35",
tr_state="434",
}