SKILLINFO = {
name= "烈火焚身",
long= "范围攻击技能.",
id=161,
bin=8,
itype=1,
job=2,  
max_level= 9,
knowledge= 1,
icon=79,
isac=1,
area=100,
roleAni=5,
addr=0,
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",--技能限制时间
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",--技能释放时间
Skill="1|1|1|1|1|1|1|1|1",--学习扣除的技能点
MP="35|40|55|75|95|120|150|200|250",
learn="1|5|10|15|20|23|26|29|35", --学习的等级条件
hit="21|40|70|110|160|230|300|370|450",
}