SKILLINFO = {
name= "火球术",
long= "$DC%几率造成$DCDAMAGE的2次伤害",
id=164,
bin=26,
itype=1,
job=2,
max_level= 9,
knowledge= 1,
icon=57,
isac=1,
area=81,
roleAni=5,
addr=3,
dc=50,--多次伤害几率
needsk="163|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="5000|5000|5000|5000|5000|5000|5000|5000|5000",
limit2="3200|3200|3200|3200|3200|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="20|23|26|29|32|35|38|41|44",
hit="90|110|140|180|230|330|450|580|750",
dcdamage="230|230|230|230|230|230|230|230|230",--2次伤害值,该值不再加基础伤害值
}