SKILLINFO = {
name= "天照",
long= "中招后对象每10秒失去$HP%的生命,持续时间$LASTTIME秒，对普通怪物无效",
id=165,
bin=8,
itype=1,
job=2,
max_level= 9,
knowledge= 1,
icon=51,
isac=1,
area=81,
roleAni=5,
addr=4,
needsk="164|4",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="180000|180000|180000|180000|180000|180000|180000|180000|180000",
limit2="3300|3300|3300|3300|3300|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="28|30|32|34|36|38|40|42|44",
tr_state="474",--持续掉血
}