SKILLINFO = {
name= "妙手回春",
long= "瞬间恢复一定血量，再持续加生命$LASTTIME秒,每5秒一次增加$HP点生命.",
id=166,
bin=15,
itype=0,
job=2,
max_level= 9,
knowledge= 1,
icon=69,
isac=0,
area=1,
roleAni=5,
addr=5,
needsk="165|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="75000|75000|75000|75000|75000|75000|75000|75000|75000",
limit2="4000|4000|4000|4000|4000|2000|2000|1000|1000",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="34|36|38|40|42|44|46|48|50",
me_state="421|420",--瞬时加血+持续加血
}