SKILLINFO = {
name= "魔法盾",
long= "使所有伤害转化为伤害$MAGICSHIELD%MP,持续时间$LASTTIME秒.对封魔和诅咒免疫.",
id=168,
bin=31,
itype=0,
job=2,
max_level= 9,
knowledge= 1,
icon=61,
isac=0,
area=5,
roleAni=5,
addr=7,
needsk="163|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="150000|150000|150000|150000|150000|150000|150000|150000|150000",
limit2="3000|3000|3000|3000|3000|1500|1500|700|700",
Skill="3|4|5|6|7|8|9|10|11",
MP="110|140|170|200|250|300|350|400|450",
learn="15|18|21|24|27|30|33|36|39",
--me_state="514",--吸收魔法伤害
me_state="428",--吸收魔法伤害
}