SKILLINFO = {
name= "毁天灭地",
long= "无视防御，对周围单位造成$SJHP的伤害，对普通怪物无效.",--瞬间加血和掉血，用SJHP
id=169,
bin=21,
itype=1,
job=2,
max_level= 9,
knowledge= 1,
icon=65,
isac=2,
area=100,
roleAni=5,
addr=8,
needsk="168|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="75000|75000|75000|75000|75000|75000|75000|75000|75000",
limit2="4000|4000|4000|4000|4000|2000|2000|1000|1000",
Skill="3|4|5|6|7|8|9|10|11",
MP="60|80|100|120|150|200|250|300|350",--魔法值对应伤害
learn="24|26|28|30|32|34|36|38|40",
tr_state="517",
}