SKILLINFO = {
name= "吞日月",
long= "增加智力$INTE点,持续$LASTTIME秒.",    ---此处不是int，而是inte，并且大写。
id=171,
bin=8,
itype=0,
job=2,
max_level= 9,
knowledge= 1,
icon=77,
isac=0,
area=1,
roleAni=5,
addr=10,
needsk="170|5",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="80000|80000|80000|80000|80000|80000|80000|80000|80000",
limit2="3200|3200|3200|3200|3200|1600|1600|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="55|75|95|120|160|200|250|300|350",
learn="36|38|40|42|44|46|48|50|52",
me_state="409",--增加自身智力
}