SKILLINFO = {
name= "镇山河",
long= "$LASTTIME秒内，处于无敌状态，对封魔无效",
id=172,
bin=27,
itype=0,
job=2,
max_level= 9,
knowledge= 1,
icon=66,
isac=0,
area=1,
roleAni=5,
addr=11,
needsk="171|6",
movebuff=2,
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="180000|170000|160000|150000|140000|130000|120000|110000|100000",
limit2="3500|3500|3500|3500|3500|1700|1700|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="45|47|49|51|53|55|57|59|61",
me_state="434",--无敌
}