SKILLINFO = {
name= "净化",
long= "消除目标增益状态，并有$SHOOT%的几率减少目标移动速度$MOVESPEED点,对普通怪物无效",
id=173,
bin=24,
itype=1,
job=2,
max_level= 9,
knowledge= 1,
icon=55,
isac=1,
area=81,
roleAni=5,
addr=12,
needsk="168|3",
movebuff=1,--移除目标增益状态
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="120000|118000|115000|112000|109000|105000|100000|95000|90000",
limit2="3500|3500|3500|3500|3500|1700|1700|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="22|24|26|28|30|32|34|36|38",
tr_state="512",
}