SKILLINFO = {
name= "裂心神",
long= "使对象不可移动,持续时间$LASTTIME秒,对普通怪物无效",
id=174,
bin=11,
itype=1,
job=2,
max_level= 9,
knowledge= 1,
icon=63,
isac=1,
area=81,
roleAni=5,
addr=13,
needsk="173|3",
}
EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="90000|90000|90000|90000|90000|85000|80000|75000|70000",
limit2="3500|3500|3500|3500|3500|1700|1700|800|800",
Skill="3|4|5|6|7|8|9|10|11",
MP="33|40|58|75|95|150|250|350|500",
learn="26|28|30|32|34|36|38|40|42",
hit="21|40|70|110|160|230|300|370|450",
tr_state="504",--目标移动速度为0
}