SKILLINFO = {
name= "掠夺",
long= "辅助型技能,怪物爆落金钱时掠夺到额外铜币,可额外获得$DEP%的铜币,持续时间$LASTTIME秒.学习2级以上时需要消耗铜币.",
id=181,
job=0,  
max_level= 9,
knowledge= 1,
icon=63,
isac=0,
addr=18,
roleAni=-6,
--needsk="106|1",
}
EFFECTINFO = {
money="0|2000|5000|8000|11000|14000|17000|20000|23000",
limit1="900000|850000|800000|750000|700000|650000|600000|550000|500000",
limit2="4500|4300|4100|3900|3700|3500|3300|3100|3000",
Skill="0|0|0|0|0|0|0|0|0",
MP="184|260|317|422|526|631|735|849|944",
learn="16|19|22|25|28|30|30|30|30",
me_state="414",
}