SKILLINFO = {
name= "天选道怨",     ---boss专属技能
long= "中招后对象每10秒失去$HP%的生命,持续时间$LASTTIME秒.",
id=218,
bin=8,
itype=1,
job=0,
max_level= 9,
knowledge= 1,
icon=79,
isac=2,    -----技能目标：所有人
area=100,  -------技能攻击范围+单体全体。个位奇数表示单体，偶数表示群体
roleAni=5,
addr=6,
}
EFFECTINFO = {
money="0|0|0|0|0|0|0|0|0",                ---学费
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",    --技能限制时间
limit2="3000|3000|3000|3000|3000|3000|3000|3000|3000",     --技能释放时间
Skill="1|2|3|4|5|6|7|8|9",                       --学习扣除的技能点，9级
MP="100|200|300|400|500|600|700|800|900",          --要的MP值，9级
--shoot="",--成功率，这个在buff中改
learn="1|10|13|15|17|19|25|30|40",       --学习该级技能需要玩家的最低级别
tr_state="521",       --调用的buff
}