SKILLINFO = {
name= "灭魂狂飙",        -------boss专属技能
long= "boss群晕技能",
id=219,
bin=9,
itype=1,
job=0,  
max_level= 9,
knowledge= 1,
icon=64,
isac=1,
area=100,--攻击范围，偶数：群体；奇数：单体
roleAni=13,
addr=6,
}
EFFECTINFO = {
money="0|0|0|0|0|0|0|0|0",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",--技能限制时间
limit2="3000|3000|3000|3000|3000|3000|3000|3000|3000",--技能释放时间
Skill="69|91|113|135|157|175|187|193|197",
MP="70|140|210|280|350|420|490|560|630",
learn="25|28|30|35|40|45|50|55|60",
hit="500|1000|1500|2000|2500|3000|3500|4000|4500",--对应的伤害值
tr_state="522",
}