SKILLINFO = {
name= "倾国银弹波",        -------boss专属技能
long= "boss小规模杀伤性技能",
id=222,
bin=9,
itype=1,
job=0,  
max_level= 9,
knowledge= 1,
icon=64,
isac=1,
area=150,--攻击范围，偶数：群体；奇数：单体
roleAni=5,
addr=6,
}
EFFECTINFO = {
money="0|0|0|0|0|0|0|0|0",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",--技能限制时间
limit2="3000|3000|3000|3000|3000|3000|3000|3000|3000",--技能释放时间
Skill="69|91|113|135|157|175|187|193|197",
MP="100|200|300|400|500|600|700|800|900",
learn="25|28|30|35|40|45|50|55|60",
hit="200|400|600|800|1000|1200|1400|1600|1800",--对应的伤害值
}