SKILLINFO = {
name= "强力弱甲",
long= "单体技能，强力降低对象防御力$DEF%",
id=223,
itype=1,
bin=24,
job=1,
max_level= 9,
knowledge= 1,
icon=71,
isac=1,
area=81,
roleAni=7,-------------------注意动作中5、6、7的区别用法
addr=2,
--needsk="102|2",
}

EFFECTINFO = {
money="0|0|0|0|10000|20000|50000|100000|200000",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",
limit2="3000|3000|3000|3000|3000|3000|3000|3000|3000",
Skill="1|2|3|4|5|6|7|8|9",
MP="41|63|85|118|149|179|206|233|254",
learn="1|10|13|15|17|19|25|30|40", 
tr_state="523",
}