SKILLINFO = {
name= "天怒",
long= "范围攻击技能.",
id=251,
bin=12,
itype=1,
job=0, 
max_level= 9,
knowledge= 1,
icon=74,
isac=1,--技能目标，我(0)，其他(1)，所有人(2)
area=150,--技能攻击范围+单体全体。个位奇数表示单体，偶数表示群体。
roleAni=13,
addr=1,
}
EFFECTINFO = {
money="0|0|0|0|0|0|0|0|0",
limit1="3200|3200|3200|3200|3200|3200|3200|3200|3200",
limit2="3000|3000|3000|3000|3000|3000|3000|3000|3000",
Skill="69|91|113|135|157|175|187|193|197",
MP="111|141|170|197|222|247|267|271|269",
learn="25|28|30|35|40|45|50|55|60",
hit="500|1000|2000|2000|2500|2500|3000|3000|3000",--对应的伤害值
}