ans = {}
ans.ask = {}
ans.ask = {1}
ans.ask = {2}
ans.ask = {3}
ans.ask = {4}
ans.ask = {5}
ans.ask = {6}

T10={
info2= "@7触发@0:桃源径 冉闵(？)*",
info3= "@7奖励@0:1200经验,200铜币*",
info4= "@7说明@0:桃源径冉闵有事找你。",
}

T11={
info2= "@7触发@0:桃源径 冉闵(？)*",
info3= "@7奖励@0:2500经验*",
info4= "@7说明@0:桃源径冉闵有事找你。",
}

T12={
info2= "@7触发@0:桃源径 冉闵(？)*",
info3= "@7奖励@0:1300经验*",
info4= "@7说明@0:桃源径冉闵有事找你。",
}

T20={
info2= "@7触发@0:建康南郊 守城士兵(？)*",
info3= "@7奖励@0:25000经验*",
info4= "@7说明@0:建康南郊守城士兵处可以接取任务。",
}

T21={
info2= "@7触发@0:建康南郊 守城士兵(？)*",
info3= "@7奖励@0:约27500经验*",
info4= "@7说明@0:建康南郊守城士兵处可以接取任务。",
}

T30={
info2= "@7触发@0:桃源村 老村长(？)*",
info3= "@7奖励@0:3000经验*",
info4= "@7说明@0:桃源村老村长处可以接取任务。",
}

T31={
info2= "@7触发@0:桃源村 老村长(？)*",
info3= "@7奖励@0:3600经验,装备*",
info4= "@7说明@0:桃源村老村长有事找你。",
}

T41={
info2= "@7触发@0:建康城南 药品商人(？)*",
info3= "@7奖励@0:25000经验,400铜币*",
info4= "@7说明@0:建康城南药品商人处可以接取@3物品合成@0任务。",
}

T44={
info2= "@7触发@0:桃源村 募兵使(？)*",
info3= "@7奖励@0:7500经验*",
info4= "@7说明@0:桃源村募兵使有事找你。",
}

T50={
info2= "@7触发@0:桃源村 孟铁匠(？)*",
info3= "@7奖励@0:6700经验*",
info4= "@7说明@0:桃源村孟铁匠处可以接取任务。",
}

T51={
info2= "@7触发@0:桃源村 孟铁匠(？)*",
info3= "@7奖励@0:7300经验,装备*",
info4= "@7说明@0:桃源村孟铁匠处可以接取任务。",
}

T60={
info2= "@7触发@0:桃源村 浣衣娘(？)*",
info3= "@7奖励@0:4200经验*",
info4= "@7说明@0:桃源村浣衣娘有事找你。",
}

T61={
info2= "@7触发@0:桃源村 浣衣娘(？)*",
info3= "@7奖励@0:5300经验,装备*",
info4= "@7说明@0:桃源村浣衣娘处可以接取任务。",
}

T72={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:79200经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3队伍集结@0任务。",
}

T73={
info2= "@7触发@0:迷雾之林 田伍长(？)*",
info3= "@7奖励@0:20000经验,1000铜币*",
info4= "@7说明@0:迷雾之林田伍长处可以接取任务。",
}

T74={
info2= "@7触发@0:迷雾之林 田伍长(？)*",
info3= "@7奖励@0:12000经验,坐骑*",
info4= "@7说明@0:迷雾之林田伍长处可以接取任务。",
}

T75={
info2= "@7触发@0:迷雾之林 田伍长(？)*",
info3= "@7奖励@0:8000经验,600铜币*",
info4= "@7说明@0:迷雾之林田伍长处可以接取任务。",
}

T81={
info2= "@7触发@0:迷雾之林 士兵甲(？)*",
info3= "@7奖励@0:约9400经验*",
info4= "@7说明@0:迷雾之林士兵甲需要你的帮忙。",
}

T84={
info2= "@7触发@0:迷雾之林 士兵甲(？)*",
info3= "@7奖励@0:8400经验,640铜币*",
info4= "@7说明@0:迷雾之林士兵甲处可接取任务。",
}

T85={
info2= "@7触发@0:迷雾之林 士兵甲(？)*",
info3= "@7奖励@0:10000经验,500铜币*",
info4= "@7说明@0:迷雾之林士兵甲有事找你。",
}

--T86={
--info2= "@7触发@0:迷雾之林 士兵甲(？)*",
--info3= "@7奖励@0:10000经验,500铜币*",
--info4= "@7说明@0:迷雾之林士兵甲有事找你。",
--}

T87={
info2= "@7触发@0:迷雾之林 士兵甲(？)*",
info3= "@7奖励@0:11000经验*",
info4= "@7说明@0:迷雾之林士兵甲有事找你。",
}

T91={
info2= "@7触发@0:迷雾之林 王主簿(？)*",
info3= "@7奖励@0:6000经验*",
info4= "@7说明@0:迷雾之林王主簿需要你的帮忙。",
}

T92={
info2= "@7触发@0:迷雾之林 王主簿(？)*",
info3= "@7奖励@0:7500经验*",
info4= "@7说明@0:迷雾之林王主簿有事找你。",
}

T93={
info2= "@7触发@0:迷雾之林 王主簿(？)*",
info3= "@7奖励@0:6530经验*",
info4= "@7说明@0:迷雾之林王主簿处可以接取任务。",
}

T111={
info2= "@7触发@0:建康城 刘裕(？)*",
info3= "@7奖励@0:25000经验*",
info4= "@7说明@0:建康城刘裕处可以接取任务。",
}

T112={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:145000经验*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}

--T114={
--info2= "@7触发@0:建康城 司马元显(？)*",
--info3= "@7奖励@0:119000经验*",
--info4= "@7说明@0:建康城司马元显处可以接取任务。",
--}

T115={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:145000经验*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}

T116={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:121275经验,1000铜币*",
info4= "@7说明@0:山寨孙恩处可以接取任务。",
}

T123={
info2= "@7触发@0:建康城 晋清公主(？)*",
info3= "@7奖励@0:119000经验*",
info4= "@7说明@0:建康城晋清公主处可以接取任务。",
}

T124={
info2= "@7触发@0:建康城 晋清公主(？)*",
info3= "@7奖励@0:119000经验*",
info4= "@7说明@0:建康城晋清公主处可以接取任务。",
}

T125={
info2= "@7触发@0:建康城 晋清公主(？)*",
info3= "@7奖励@0:119000经验*",
info4= "@7说明@0:建康城晋清公主处可以接取任务。",
}

T126={
info2= "@7触发@0:建康城 晋清公主(？)*",
info3= "@7奖励@0:112500经验,1000铜币*",
info4= "@7说明@0:建康城晋清公主处可以接取任务。",
}

--Tbaitan={
--info2= "@7触发@0:建康城南 防具商人(？)*",
--info3= "@7奖励@0:41000经验*",
--info4= "@7说明@0:建康城南防具商人处可以接取@3摆摊@0任务。",
--}

T191={
info2= "@7触发@0:建康城 活动使者(？)*",
info3= "@7奖励@0:200000经验,2800铜币*",
info4= "@7说明@0:建康城活动使者处可以接取任务。",
}

T211={
info2= "@7触发@0:建康城南 种子商人(？)*",
info3= "@7奖励@0:80000经验,2000铜币*",
info4= "@7说明@0:建康城南种子商人处可以接取任务。",
}

T230={
info2= "@7触发@0:建康城南 武器商人(？)*",
info3= "@7奖励@0:25000经验*",
info4= "@7说明@0:建康城南武器商人处可以接取任务。",
}

T263={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:25000经验*",
info4= "@7说明@0:建康城南谢安处可以接取@3军中潜龙@0任务。",
}

T266={
info2= "@7触发@0:建康城南 谢道韫(？)*",
info3= "@7奖励@0:76230经验*",
info4= "@7说明@0:山寨谢道韫处可以接取@3谢家风骨@0任务。",
}

T267={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:24730经验*",
info4= "@7说明@0:建康城南谢安处可以接取@3贤臣桓冲@0任务。",
}


T268={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:54450经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3帮派国家@0任务。",
}

T278={
info2= "@7触发@0:山寨 谢道韫(？)*",
info3= "@7奖励@0:90000经验,800铜币*",
info4= "@7说明@0:建康城南刘裕处可以接取@3巾帼授业@0任务。",
}

T275={
info2= "@7触发@0:建康城南 刘裕(？)*",
info3= "@7奖励@0:24000经验*",
info4= "@7说明@0:建康城南刘裕处可以接取任务。",
}

T276={
info2= "@7触发@0:建康城南 刘裕(？)*",
info3= "@7奖励@0:29700经验*",
info4= "@7说明@0:建康城南刘裕处可以接取@3刘裕的考验@0任务。",
}

T277={
info2= "@7触发@0:建康城南 刘裕(？)*",
info3= "@7奖励@0:29700经验*",
info4= "@7说明@0:建康城南刘裕处可以接取@3伤患治疗@0任务。",
}

T280={
info2= "@7触发@0:宫殿 晋帝(？)*",
info3= "@7奖励@0:108000经验*",
info4= "@7说明@0:宫殿晋帝处可以接取任务。",
}

T290={
info2= "@7触发@0:宫殿 司马道子(？)*",
info3= "@7奖励@0:145000经验*",
info4= "@7说明@0:宫殿司马道子处可以接取任务。",
}

T291={
info2= "@7触发@0:宫殿 司马道子(？)*",
info3= "@7奖励@0:108000经验*",
info4= "@7说明@0:宫殿司马道子处可以接取任务。",
}

T321={
info2= "@7触发@0:建康东郊 桓冲(？)*",
info3= "@7奖励@0:40590经验*",
info4= "@7说明@0:建康东郊桓冲处可以接取任务。",
}

T322={
info2= "@7触发@0:建康东郊 桓冲(？)*",
info3= "@7奖励@0:47520经验*",
info4= "@7说明@0:建康东郊桓冲处可以接取@3叔侄之情@0任务。",
}

T323={
info2= "@7触发@0:建康东郊 桓冲(？)*",
info3= "@7奖励@0:32660经验*",
info4= "@7说明@0:建康东郊桓冲处可以接取任务。",
}

T326={
info2= "@7触发@0:建康东郊 桓冲(？)*",
info3= "@7奖励@0:47520经验*",
info4= "@7说明@0:建康东郊桓冲处可以接取@3天师道@0任务。",
}

T330={
info2= "@7触发@0:建康东郊 王恭(？)*",
info3= "@7奖励@0:21000经验*",
info4= "@7说明@0:建康东郊王恭处可以接取任务。",
}

--T331={
--info2= "@7触发@0:建康东郊 王恭(？)*",
--info3= "@7奖励@0:45100经验*",
--info4= "@7说明@0:建康东郊王恭处可以接取@3东郊狩猎@0任务。",
--}

T332={
info2= "@7触发@0:建康东郊 王恭(？)*",
info3= "@7奖励@0:40520经验*",
info4= "@7说明@0:建康东郊王恭处可以接取@3偷上战场@0任务。",
}

T333={
info2= "@7触发@0:建康东郊 王恭(？)*",
info3= "@7奖励@0:47520经验*",
info4= "@7说明@0:建康东郊王恭处可以接取@3东征监军@0任务。",
}

T334={
info2= "@7触发@0:建康东郊 王恭(？)*",
info3= "@7奖励@0:64000经验,1000铜币*",
info4= "@7说明@0:建康东郊王恭处可以接取@3王恭的教诲@0任务。",
}

T336={
info2= "@7触发@0:建康东郊 王恭(？)*",
info3= "@7奖励@0:4059f0经验*",
info4= "@7说明@0:建康东郊王恭处可以接取@3赌命之徒@0任务。",
}

T351={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:62100经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3初战天师道@0任务。",
}

T352={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:60310经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3破敌之策@0任务。",
}

T353={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:65000经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3知己知彼@0任务。",
}

T354={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:约22000经验，200铜币*",
info4= "@7说明@0:五斗山桓玄处可以接取任务。",
}

T355={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:76230经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3谢家女将@0任务。",
}

T356={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:58380经验,500铜币*",
info4= "@7说明@0:五斗山桓玄处可以接取@3蛮夷阴谋@0任务。",
}

T357={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:61380经验*",
info4= "@7说明@0:五斗山桓玄处可以接取@3天下之势@0任务。",
}

T358={
info2= "@7触发@0:五斗山 桓玄(？)*",
info3= "@7奖励@0:58380经验,1000铜币*",
info4= "@7说明@0:五斗山桓玄处可以接取@3桓玄之志@0任务。",
}

T360={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:62000经验,500铜币*",
info4= "@7说明@0:五斗山天师教徒处可以接取@3偷梁换柱@0任务。",
}

T361={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:约23000经验，200铜币*",
info4= "@7说明@0:五斗山天师教徒处可以接取任务。",
}

T362={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:80000经验，宠物*",
info4= "@7说明@0:五斗山天师教徒处可以接取任务。",
}

T363={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:80000经验，藏宝图*",
info4= "@7说明@0:五斗山天师教徒处可以接取任务。",
}

T368={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:69000经验,1000铜币*",
info4= "@7说明@0:五斗山天师教徒处可以接取@3邪术诅咒@0任务。",
}

T369={
info2= "@7触发@0:五斗山 天师教徒(？)*",
info3= "@7奖励@0:65000经验*",
info4= "@7说明@0:五斗山天师教徒处可以接取@3教徒的疑虑@0任务。",
}

T370={
info2= "@7触发@0:山寨 孙恩(？)*",
info3= "@7奖励@0:99000经验*",
info4= "@7说明@0:山寨孙恩处可以接取@3嗜血狂徒@0任务。",
}

T371={
info2= "@7触发@0:山寨 孙恩(？)*",
info3= "@7奖励@0:121000经验*",
info4= "@7说明@0:山寨孙恩处可以接取@3暴露身份@0任务。",
}

T373={
info2= "@7触发@0:山寨 孙恩(？)*",
info3= "@7奖励@0:80100经验*",
info4= "@7说明@0:山寨孙恩处可以接取@3巾帼红颜@0任务。",
}

T374={
info2= "@7触发@0:山寨 孙恩(？)*",
info3= "@7奖励@0:121275经验*",
info4= "@7说明@0:山寨孙恩处可以接取@3叛逆之因@0任务。",
}

--T375={
--info2= "@7触发@0:山寨 孙恩(？)*",
--info3= "@7奖励@0:138600经验，2000铜币*",
--info4= "@7说明@0:山寨孙恩处可以接取任务。",
--}

T380={
info2= "@7触发@0:山寨 谢道韫(？)*",
info3= "@7奖励@0:76230经验*",
info4= "@7说明@0:山寨谢道韫处可以接取@3天师秘术@0任务。",
}

T381={
info2= "@7触发@0:山寨 谢道韫(？)*",
info3= "@7奖励@0:82100经验*",
info4= "@7说明@0:山寨谢道韫处可以接取@3夫君的下落@0任务。",
}

T382={
info2= "@7触发@0:山寨 谢道韫(？)*",
info3= "@7奖励@0:约26000经验，200铜币*",
info4= "@7说明@0:山寨谢道韫处可以接取任务。",
}

T384={
info2= "@7触发@0:山寨 谢道韫(？)*",
info3= "@7奖励@0:89100经验,2000铜币*",
info4= "@7说明@0:山寨谢道韫处可以接取@3千里共婵娟@0任务。",
}

--T391={
--info2= "@7触发@0:山寨地牢 王凝之(？)*",
--info3= "@7奖励@0:99000经验*",
--info4= "@7说明@0:山寨地牢王凝之处可以接取@3救治英雄@0任务。",
--}

T392={
info2= "@7触发@0:山寨地牢 王凝之(？)*",
info3= "@7奖励@0:118800经验*",
info4= "@7说明@0:山寨地牢王凝之处可以接取@3地牢之谜@0任务。",
}

T393={
info2= "@7触发@0:山寨地牢 王凝之(？)*",
info3= "@7奖励@0:275000经验,2000铜币*",
info4= "@7说明@0:山寨地牢王凝之处可以接取@3破除邪术@0任务。",
}

--T394={
--info2= "@7触发@0:山寨地牢 王凝之(？)*",
--info3= "@7奖励@0:约32000经验*",
--info4= "@7说明@0:山寨地牢王凝之处可以接取任务。",
--}

T395={
info2= "@7触发@0:山寨地牢 王凝之(？)*",
info3= "@7奖励@0:120000经验*",
info4= "@7说明@0:山寨地牢王凝之处可以接取任务。",
}

T400={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:184000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T401={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:184000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T402={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:156000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T403={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:196000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T404={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:164000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T405={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:184000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T406={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:约35000经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T407={
info2= "@7触发@0:北府军营 谢玄(？)*",
info3= "@7奖励@0:112500经验*",
info4= "@7说明@0:北府军营谢玄处可以接取任务。",
}

T411={
info2= "@7触发@0:北府军营 何统领(？)*",
info3= "@7奖励@0:？经验*",
info4= "@7说明@0:北府军营何统领处可以接取任务。",
}

T412={
info2= "@7触发@0:北府军营 何统领(？)*",
info3= "@7奖励@0:156000经验*",
info4= "@7说明@0:北府军营何统领处可以接取任务。",
}

T423={
info2= "@7触发@0:北府军营 驿站小吏(？)*",
info3= "@7奖励@0:109000经验*",
info4= "@7说明@0:北府军营驿站小吏处可以接取任务。",
}

T424={
info2= "@7触发@0:北府军营 驿站小吏(？)*",
info3= "@7奖励@0:156000经验*",
info4= "@7说明@0:北府军营驿站小吏处可以接取任务。",
}

T425={
info2= "@7触发@0:北府军营 驿站小吏(？)*",
info3= "@7奖励@0:156000经验*",
info4= "@7说明@0:北府军营驿站小吏处可以接取任务。",
}

T426={
info2= "@7触发@0:北府军营 驿站小吏(？)*",
info3= "@7奖励@0:156000经验*",
info4= "@7说明@0:北府军营驿站小吏处可以接取任务。",
}

T440={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:228000经验*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T441={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:228000经验*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T442={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:196000经验*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T443={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:238000经验*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T445={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:约36000经验，300铜币*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T450={
info2= "@7触发@0:淝水之滨 刘牢之(？)*",
info3= "@7奖励@0:243000经验*",
info4= "@7说明@0:淝水之滨刘牢之处可以接取任务。",
}

T451={
info2= "@7触发@0:淝水之滨 刘牢之(？)*",
info3= "@7奖励@0:243000经验*",
info4= "@7说明@0:淝水之滨刘牢之处可以接取任务。",
}

T452={
info2= "@7触发@0:淝水之滨 刘牢之(？)*",
info3= "@7奖励@0:243000经验*",
info4= "@7说明@0:淝水之滨刘牢之处可以接取任务。",
}

T453={
info2= "@7触发@0:淝水之滨 刘牢之(？)*",
info3= "@7奖励@0:243000经验*",
info4= "@7说明@0:淝水之滨刘牢之处可以接取任务。",
}

T454={
info2= "@7触发@0:淝水之滨 刘牢之(？)*",
info3= "@7奖励@0:238000经验*",
info4= "@7说明@0:淝水之滨刘牢之处可以接取任务。",
}

T460={
info2= "@7触发@0:淝水之滨 何谦(？)*",
info3= "@7奖励@0:254000经验*",
info4= "@7说明@0:淝水之滨何谦处可以接取任务。",
}

T461={
info2= "@7触发@0:淝水之滨 何谦(？)*",
info3= "@7奖励@0:243000经验*",
info4= "@7说明@0:淝水之滨何谦处可以接取任务。",
}

T462={
info2= "@7触发@0:淝水之滨 何谦(？)*",
info3= "@7奖励@0:约32000经验，300铜币*",
info4= "@7说明@0:淝水之滨何谦处可以接取任务。",
}

T463={
info2= "@7触发@0:淝水之滨 何谦(？)*",
info3= "@7奖励@0:约34000经验*",
info4= "@7说明@0:淝水之滨何谦处可以接取任务。",
}

T470={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:279000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T471={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:254000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T472={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:254000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T473={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:500000经验,4000铜币*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T474={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:约34000经验，300铜币*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T475={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:266000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T476={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:266000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T477={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:266000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T480={
info2= "@7触发@0:洛阳郊外 难民(？)*",
info3= "@7奖励@0:约40000经验*",
info4= "@7说明@0:洛阳郊外难民处可以接取任务。",
}

T482={
info2= "@7触发@0:洛阳郊外 难民(？)*",
info3= "@7奖励@0:279000经验*",
info4= "@7说明@0:洛阳郊外难民处可以接取任务。",
}

T485={
info2= "@7触发@0:洛阳郊外 难民(？)*",
info3= "@7奖励@0:279000经验*",
info4= "@7说明@0:洛阳郊外难民处可以接取任务。",
}

T486={
info2= "@7触发@0:洛阳郊外 难民(？)*",
info3= "@7奖励@0:279000经验*",
info4= "@7说明@0:洛阳郊外难民处可以接取任务。",
}

T490={
info2= "@7触发@0:洛阳郊外 苻融(？)*",
info3= "@7奖励@0:283000经验*",
info4= "@7说明@0:洛阳郊外苻融处可以接取任务。",
}

T499={
info2= "@7触发@0:洛阳郊外 苻融(？)*",
info3= "@7奖励@0:283000经验*",
info4= "@7说明@0:洛阳郊外苻融处可以接取任务。",
}

T500={
info2= "@7触发@0:洛阳城 苻坚(？)*",
info3= "@7奖励@0:502000经验*",
info4= "@7说明@0:洛阳城苻坚处可以接取任务。",
}

T505={
info2= "@7触发@0:洛阳城 苻坚(？)*",
info3= "@7奖励@0:204000经验*",
info4= "@7说明@0:洛阳城苻坚处可以接取任务。",
}

T506={
info2= "@7触发@0:洛阳城 苻坚(？)*",
info3= "@7奖励@0:301000经验*",
info4= "@7说明@0:洛阳城苻坚处可以接取任务。",
}

T507={
info2= "@7触发@0:洛阳城 苻坚(？)*",
info3= "@7奖励@0:301000经验*",
info4= "@7说明@0:洛阳城苻坚处可以接取任务。",
}

T512={
info2= "@7触发@0:洛阳城 王镇恶(？)*",
info3= "@7奖励@0:294000经验*",
info4= "@7说明@0:洛阳城王镇恶处可以接取任务。",
}

T513={
info2= "@7触发@0:洛阳城 王镇恶(？)*",
info3= "@7奖励@0:283000经验*",
info4= "@7说明@0:洛阳城王镇恶处可以接取任务。",
}

T533={
info2= "@7触发@0:洛阳城 武器商人(？)*",
info3= "@7奖励@0:294000经验*",
info4= "@7说明@0:洛阳城武器商人处可以接取任务。",
}

T552={
info2= "@7触发@0:洛阳城 药品商人(？)*",
info3= "@7奖励@0:约40000经验，400铜币*",
info4= "@7说明@0:洛阳城药品商人处可以接取任务。",
}

T560={
info2= "@7触发@0:渭水之滨 姚苌(？)*",
info3= "@7奖励@0:204000经验*",
info4= "@7说明@0:渭水之滨姚苌处可以接取任务。",
}

T561={
info2= "@7触发@0:渭水之滨 姚苌(？)*",
info3= "@7奖励@0:241000经验*",
info4= "@7说明@0:渭水之滨姚苌处可以接取任务。",
}

T565={
info2= "@7触发@0:渭水之滨 姚苌(？)*",
info3= "@7奖励@0:241000经验*",
info4= "@7说明@0:渭水之滨姚苌处可以接取任务。",
}

T570={
info2= "@7触发@0:渭水之滨 张氏(？)*",
info3= "@7奖励@0:241000经验*",
info4= "@7说明@0:渭水之滨张氏处可以接取任务。",
}

T571={
info2= "@7触发@0:渭水之滨 张氏(？)*",
info3= "@7奖励@0:约40000经验，400铜币*",
info4= "@7说明@0:渭水之滨张氏处可以接取任务。",
}

T580={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:252000经验*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T581={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:252000经验*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T582={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:309000经验*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T583={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:275000经验*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T584={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:252000经验*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T587={
info2= "@7触发@0:西蜀竹林 乞伏国仁(？)*",
info3= "@7奖励@0:约44000经验，500铜币*",
info4= "@7说明@0:西蜀竹林乞伏国仁处可以接取任务。",
}

T590={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:252000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T591={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:274000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T592={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:275000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T593={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:319000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T594={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:400000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T595={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:264000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T597={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:284000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T599={
info2="@7触发@0:西蜀竹林 鬼夫人(? )*",
info3="@7奖励@0:285000经验*",
info4="@7说明@0:西蜀竹林鬼夫人处可以接取任务。",
}

T600={
info2="@7触发@0:食人谷 羯族巫师(? )*",
info3="@7奖励@0:319000经验*",
info4="@7说明@0:食人谷羯族巫师处可以接取任务。",
}

T601={
info2="@7触发@0:食人谷 羯族巫师(? )*",
info3="@7奖励@0:319000经验*",
info4="@7说明@0:食人谷羯族巫师处可以接取任务。",
}

T604={
info2="@7触发@0:食人谷 羯族巫师(? )*",
info3="@7奖励@0:循环任务根据角色等级而定，大概5W左右，300铜币*",
info4="@7说明@0:食人谷羯族巫师处可以接取任务。",
}

T610={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:337000经验*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T611={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:337000经验*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T612={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:371000经验*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T613={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:351000经验*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T614={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:400000经验,5050铜币*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T615={
info2="@7触发@0:白骨洞 乞伏奎(? )*",
info3="@7奖励@0:约360000经验，400铜币*",
info4="@7说明@0:白骨洞乞伏奎处可以接取任务。",
}

T620={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:385000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

T621={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:385000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

T622={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:385000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

T624={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:417000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

T625={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:417000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

T626={
info2="@7触发@0:洛城废墟 陶渊明(? )*",
info3="@7奖励@0:417000经验*",
info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
}

--T627={
--info2="@7触发@0:洛城废墟 陶渊明(? )*",
--info3="@7奖励@0:约420000经验*",
--info4="@7说明@0:洛城废墟陶渊明处可以接取任务。",
--}

T630={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:548000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T633={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:100000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T631={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T634={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:548000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T635={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:约590000经验，500铜币*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T636={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T637={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:598000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T638={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:548000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T639={
info2="@7触发@0:太行古径 慕容垂(? )*",
info3="@7奖励@0:598000经验*",
info4="@7说明@0:太行古径慕容垂处可以接取任务。",
}

T641={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T642={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T644={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:598000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T645={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:598000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T646={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:898000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T647={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:548000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T648={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:598000经验*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T649={
info2="@7触发@0:太行古径 慕容麟(? )*",
info3="@7奖励@0:约700000经验，500铜币*",
info4="@7说明@0:太行古径慕容麟处可以接取任务。",
}

T651={
info2="@7触发@0:太行山谷 石越(? )*",
info3="@7奖励@0:651000经验*",
info4="@7说明@0:太行山谷石越处可以接取任务。",
}

T653={
info2="@7触发@0:太行山谷 石越(? )*",
info3="@7奖励@0:767000经验*",
info4="@7说明@0:太行山谷石越处可以接取任务。",
}

T654={
info2="@7触发@0:太行山谷 石越(? )*",
info3="@7奖励@0:767000经验*",
info4="@7说明@0:太行山谷石越处可以接取任务。",
}

T655={
info2="@7触发@0:太行山谷 石越(? )*",
info3="@7奖励@0:1500000经验*",
info4="@7说明@0:太行山谷石越处可以接取任务。",
}

T656={
info2="@7触发@0:太行山谷 石越(? )*",
info3="@7奖励@0:约90000经验,500铜币*",
info4="@7说明@0:太行山谷石越处可以接取任务。",
}

--[[ ---此系列任务存在严重逻辑问题,请慎重去掉注释
T660={
info2="@7触发@0:参合坡 浑太后(? )*",
info3="@7奖励@0:972000经验*",
info4="@7说明@0:参合坡浑太后处可以接取任务。",
}]]

T661={
info2="@7触发@0:参合坡 浑太后(? )*",
info3="@7奖励@0:898000经验*",
info4="@7说明@0:参合坡浑太后处可以接取任务。",
}

T662={
info2="@7触发@0:参合坡 浑太后(? )*",
info3="@7奖励@0:898000经验*",
info4="@7说明@0:参合坡浑太后处可以接取任务。",
}

T663={
info2="@7触发@0:参合坡 浑太后(? )*",
info3="@7奖励@0:972000经验*",
info4="@7说明@0:参合坡浑太后处可以接取任务。",
}

T664={
info2="@7触发@0:参合坡 浑太后(? )*",
info3="@7奖励@0:约230000经验，600铜币*",
info4="@7说明@0:参合坡浑太后处可以接取任务。",
}

T670={
info2="@7触发@0:参合坡 慕容评(? )*",
info3="@7奖励@0:1126000经验*",
info4="@7说明@0:参合坡慕容评处可以接取任务。",
}

T671={
info2="@7触发@0:参合坡 慕容评(? )*",
info3="@7奖励@0:1052000经验*",
info4="@7说明@0:参合坡慕容评处可以接取任务。",
}

T672={
info2="@7触发@0:参合坡 慕容评(? )*",
info3="@7奖励@0:1052000经验*",
info4="@7说明@0:参合坡慕容评处可以接取任务。",
}

T680={
info2="@7触发@0:中山城 侍者(? )*",
info3="@7奖励@0:1306000经验*",
info4="@7说明@0:中山城侍者处可以接取任务。",
}

T681={
info2="@7触发@0:中山城 侍者(? )*",
info3="@7奖励@0:约260000经验，600铜币*",
info4="@7说明@0:中山城侍者处可以接取任务。",
}

T690={
info2="@7触发@0:中山城 燕王(? )*",
info3="@7奖励@0:1211000经验*",
info4="@7说明@0:中山城燕王处可以接取任务。",
}

T691={
info2="@7触发@0:中山城 燕王(? )*",
info3="@7奖励@0:1211000经验*",
info4="@7说明@0:中山城燕王处可以接取任务。",
}

T692={
info2="@7触发@0:中山城 燕王(? )*",
info3="@7奖励@0:1126000经验*",
info4="@7说明@0:中山城燕王处可以接取任务。",
}

T710={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:1306000经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T711={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:1391000经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T712={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:1493000经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T713={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:1707000经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T714={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:2400000经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T715={
info2="@7触发@0:燕王陵 守墓老人(? )*",
info3="@7奖励@0:1306000经验，600经验*",
info4="@7说明@0:燕王陵守墓老人处可以接取任务。",
}

T730={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:459000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T731={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:约77000经验，500铜币*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T732={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T733={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T734={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:459000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T735={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:459000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T736={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:707000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T737={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T738={
info2="@7触发@0:陷落关口 拓拔仪(? )*",
info3="@7奖励@0:502000经验*",
info4="@7说明@0:陷落关口拓拔仪处可以接取任务。",
}

T743={
info2="@7触发@0:陷落关口 老翁(? )*",
info3="@7奖励@0:约420000经验，500铜币*",
info4="@7说明@0:陷落关口老翁处可以接取任务。",
}

T744={
info2="@7触发@0:陷落关口 老翁(? )*",
info3="@7奖励@0:459000经验*",
info4="@7说明@0:陷落关口老翁处可以接取任务。",
}

T745={
info2="@7触发@0:陷落关口 老翁(? )*",
info3="@7奖励@0:459000经验*",
info4="@7说明@0:陷落关口老翁处可以接取任务。",
}

T750={
info2="@7触发@0:敕勒川 崔宏(? )*",
info3="@7奖励@0:1707000经验*",
info4="@7说明@0:敕勒川崔宏处可以接取任务。",
}

T751={
info2="@7触发@0:敕勒川 崔宏(? )*",
info3="@7奖励@0:约230000经验，500铜币*",
info4="@7说明@0:敕勒川崔宏处可以接取任务。",
}

T800={
info2= "@7触发@0:云中城郊外 拓跋烈(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:云中城郊外拓跋烈处可以接取任务。",
}

T801={
info2= "@7触发@0:云中城郊外 拓跋烈(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:云中城郊外拓跋烈处可以接取任务。",
}

T810={
info2= "@7触发@0:古战场 耶律雄才(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:古战场耶律雄才处可以接取任务。",
}

T811={
info2= "@7触发@0:古战场 耶律雄才(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:古战场耶律雄才处可以接取任务。",
}

T820={
info2= "@7触发@0:契丹部落 契丹族长(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:契丹部落契丹族长处可以接取任务。",
}

T821={
info2= "@7触发@0:契丹部落 契丹族长(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:契丹部落契丹族长处可以接取任务。",
}

T830={
info2= "@7触发@0:沙漠绿洲 吕光(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:沙漠绿洲吕光处可以接取任务。",
}

T831={
info2= "@7触发@0:沙漠绿洲 吕光(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:沙漠绿洲吕光处可以接取任务。",
}

T840={
info2= "@7触发@0:漠北大荒 宇文元(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:漠北大荒宇文元处可以接取任务。",
}

T841={
info2= "@7触发@0:漠北大荒 宇文元(？)*",
info3= "@7奖励@0:约240000经验，600铜币*",
info4= "@7说明@0:漠北大荒宇文元处可以接取任务。",
}

T850={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:108000经验*",
info4= "@7说明@0:建康城南谢安处可以接取任务。",
}

T851={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:108000经验*",
info4= "@7说明@0:建康城南谢安处可以接取任务。",
}

T852={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:119000经验*",
info4= "@7说明@0:建康城南谢安处可以接取任务。",
}

T853={
info2= "@7触发@0:淝水对岸 朱序(？)*",
info3= "@7奖励@0:254000经验*",
info4= "@7说明@0:淝水对岸朱序处可以接取任务。",
}

T854={
info2= "@7触发@0:宫殿 司马道子(？)*",
info3= "@7奖励@0:约35000经验*",
info4= "@7说明@0:宫殿司马道子处可以接取任务。",
}

T855={
info2= "@7触发@0:宫殿 司马道子(？)*",
info3= "@7奖励@0:145000经验*",
info4= "@7说明@0:宫殿司马道子处可以接取任务。",
}

T299={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:145000经验*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}
T262={
info2= "@7触发@0:建康城南 谢安(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城南谢安处可以接取任务。",
}
T271={
info2= "@7触发@0:建康城南 刘裕(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城南刘裕处可以接取任务。",
}
Tfind={
info2= "@7触发@0:建康城南 饰品商人(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城南饰品商人处可以接取任务。",
}
T200={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}
T270={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}
Txhuanxing={
info2= "@7触发@0:建康城 司马元显(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城司马元显处可以接取任务。",
}
--T110={
--info2= "@7触发@0:建康城南 刘裕(？)*",
--info3= "@7奖励@0:每日任务和等级相关*",
--info4= "@7说明@0:建康城南刘裕处可以接取任务。",
--}
Tqlxs={
info2= "@7触发@0:建康城南 种子商人(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城南种子商人处可以接取任务。",
}
T515={
info2= "@7触发@0:洛阳城 王振恶(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:洛阳城王振恶处可以接取任务。",
}
T216={
info2= "@7触发@0:建康城 晋清公主(？)*",
info3= "@7奖励@0:每日活动和等级相关*",
info4= "@7说明@0:建康城晋清公主处可以接取任务。",
}
--T932={
--info2= "@7触发@0:宫殿 司马道子(？)*",
--info3= "@7奖励@0:每日任务和等级相关*",
--info4= "@7说明@0:宫殿司马道子处可以接取任务。",
--}
Twenda={
info2= "@7触发@0:建康城南 种子商人(？)*",
info3= "@7奖励@0:每日任务和等级相关*",
info4= "@7说明@0:建康城南种子商人处可以接取任务。",
}

T446={
info2= "@7触发@0:军营前哨 谢琰(？)*",
info3= "@7奖励@0:270000经验*",
info4= "@7说明@0:军营前哨谢琰处可以接取任务。",
}

T960={
info2= "@7触发@0:匈奴王庭 匈奴王(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:匈奴王庭匈奴王可以接取任务。",
}

T961={
info2= "@7触发@0:匈奴王庭 匈奴王(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:匈奴王庭匈奴王可以接取任务。",
}

T950={
info2= "@7触发@0:极西走廊 沮渠蒙逊(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:极西走廊沮渠蒙逊可以接取任务。",
}

T951={
info2= "@7触发@0:极西走廊 沮渠蒙逊(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:极西走廊沮渠蒙逊可以接取任务。",
}

T901={
info2= "@7触发@0:沙漠迷宫 秃发乌孤(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:沙漠迷宫秃发乌孤可以接取任务。",
}

T861={
info2= "@7触发@0:沙漠迷宫 秃发乌孤(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:沙漠迷宫秃发乌孤可以接取任务。",
}

T860={
info2= "@7触发@0:沙漠迷宫 秃发乌孤(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:沙漠迷宫秃发乌孤可以接取任务。",
}

T900={
info2= "@7触发@0:柔然领地 天师卢循(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:柔然领地师卢循可以接取任务。",
}

T901={
info2= "@7触发@0:柔然领地 天师卢循(？)*",
info3= "@7奖励@0:循环任务经验与等级相关*",
info4= "@7说明@0:柔然领地师卢循可以接取任务。",
}
function FindTask(TaskTpey) 
	local level= LuaQuery("level")
	nTaskNum = 1
	if(LuaQueryTask("T12")==0) then
		ans.ask[nTaskNum]={ID="T12",name="领取装备"}
		nTaskNum = nTaskNum + 1
	end
	if(LuaQueryTask("T10")==0) then
		ans.ask[nTaskNum]={ID="T10",name="第一次打怪[教程]"}
		nTaskNum = nTaskNum + 1
	end	
	if(LuaQueryTask("T11")==0 and LuaQueryTask("T10")==99) then
		ans.ask[nTaskNum]={ID="T11",name="回乡[剧情]"}
		nTaskNum = nTaskNum + 1
	end
	if(level>=3) then
		if(LuaQueryTask("T31")==0 and LuaQueryTask("T30")==99) then
			ans.ask[nTaskNum]={ID="T31",name="成长之路[剧情]"}
			nTaskNum = nTaskNum + 1
		end
		if(LuaQueryTask("T30")==0 and LuaQueryTask("T11")==99) then
			ans.ask[nTaskNum]={ID="T30",name="如何聊天[教程]"}
			nTaskNum = nTaskNum + 1
		end 
	end
	if(level<5)then
		if(level>=4) then
			if(LuaQueryTask("T61")==0 and LuaQueryTask("T60") ==99) then
				ans.ask[nTaskNum]={ID="T61",name="成长之路2[剧情]"}
				nTaskNum = nTaskNum + 1
			end
		if(LuaQueryTask("T60")==0 and LuaQueryTask("T31") ==99) then
			ans.ask[nTaskNum]={ID="T60",name="使用物品[教程]"}
			nTaskNum = nTaskNum + 1
		end 
	end	
		ans.count = nTaskNum - 1
		return ans.ask
		    
	elseif(level<10)then
		if(level>=5 and nTaskNum <11) then
			if(LuaQueryTask("T50")==0 and LuaQueryTask("T61") ==99) then
				ans.ask[nTaskNum]={ID="T50",name="采集[教程]"}
				nTaskNum = nTaskNum + 1
			end
			if(LuaQueryTask("T51")==0  and LuaQueryTask("T50")~=0) then
				ans.ask[nTaskNum]={ID="T51",name="从军[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
		end
		 if(level>=7 and nTaskNum<11) then                    
			if(LuaQueryTask("T84")==0 and LuaQueryTask("T85")==99) then
				ans.ask[nTaskNum]={ID="T84",name="使用装备[教程]"}
				nTaskNum = nTaskNum + 1
			end
			if(LuaQueryTask("T93")==0 and LuaQueryTask("T51") ==99) then
				ans.ask[nTaskNum]={ID="T93",name="购买道具[教程]"}
				nTaskNum = nTaskNum + 1
			end
			if(LuaQueryTask("T92")==0 and LuaQueryTask("T93") ==99) then
				ans.ask[nTaskNum]={ID="T92",name="真正的历练[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T75")==0) then
				ans.ask[nTaskNum]={ID="T75",name="自我提升[教程]"}
				nTaskNum = nTaskNum + 1
			end
			if(LuaQueryTask("T85") <99 and LuaQueryTask("T92")==99)then
				ans.ask[nTaskNum]={ID="T85",name="行伍教化"}
				nTaskNum = nTaskNum + 1
			end     
		end
		if(level>=9) then
			if(LuaQueryTask("T73")==0 and LuaQueryTask("T75")==99) then
				ans.ask[nTaskNum]={ID="T73",name="异族之患[BOSS]"}
				nTaskNum = nTaskNum + 1
			end             
		end
		ans.count = nTaskNum - 1
		return ans.ask
     elseif(level>9 and level<15)then
		if(nTaskNum<16) then
			if(LuaQueryTask("T73")==0 and LuaQueryTask("T75")==99) then
				ans.ask[nTaskNum]={ID="T73",name="异族之患[BOSS]"}
				nTaskNum = nTaskNum + 1
			end 
			if(LuaQueryTask("T74")==0 and LuaQueryTask("T75")==99) then
				ans.ask[nTaskNum]={ID="T74",name="策马扬鞭[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			
			if(LuaQueryTask("T21")==0 and LuaQueryTask("T74")==99) then
				ans.ask[nTaskNum]={ID="T21",name="擎天之柱[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T263")==0) then
				ans.ask[nTaskNum]={ID="T263",name="军中潜龙[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T41")==0) then
				ans.ask[nTaskNum]={ID="T41",name="物品合成[教程]"}
				nTaskNum = nTaskNum + 1
			end

			if(LuaQueryTask("T267")==0 and LuaQueryTask("T276")==99) then
				ans.ask[nTaskNum]={ID="T267",name="贤臣桓冲[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T276")==0 and level>=11 and LuaQueryTask("T263")==99) then
				ans.ask[nTaskNum]={ID="T276",name="刘裕的考验[剧情]"}
				nTaskNum = nTaskNum + 1    
			end

			if(LuaQueryTask("T323")==0) then
				ans.ask[nTaskNum]={ID="T323",name="治世之道[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T211")==0) then
				ans.ask[nTaskNum]={ID="T211",name="采集种植[教程]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T336")==0 and LuaQueryTask("T323") == 99) then
				ans.ask[nTaskNum]={ID="T336",name="赌命之徒[剧情]"}
				nTaskNum = nTaskNum + 1    
			end

			--检查到此
			if(LuaQueryTask("T321")==0 and LuaQueryTask("T267")==99) then
				ans.ask[nTaskNum]={ID="T321",name="桓氏家族[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			
			if(LuaQueryTask("T275")==0 and level<17) then
				ans.ask[nTaskNum]={ID="T275",name="筹措军备[循环]"}
				nTaskNum = nTaskNum + 1    
			end

			if(LuaQueryTask("T334")<99 and LuaQueryTask("T336")==99) then
				ans.ask[nTaskNum]={ID="T334",name="王恭的教诲1"}
				nTaskNum = nTaskNum + 1   
			end
			if(LuaQueryTask("T333")==0 and  LuaQueryTask("T334")==0) then
				ans.ask[nTaskNum]={ID="T333",name="东征监军[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T332")==0 and LuaQueryTask("T333")==99) then
				ans.ask[nTaskNum]={ID="T332",name="偷上战场[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T322")==0 and LuaQueryTask("T321") ==99) then
				ans.ask[nTaskNum]={ID="T322",name="叔侄之情[剧情]"}
				nTaskNum = nTaskNum + 1    
			end
			if(LuaQueryTask("T354")==0) then
				ans.ask[nTaskNum]={ID="T354",name="消灭乱兵[循环]"}
				nTaskNum = nTaskNum + 1    
			end	
		end  
		ans.count = nTaskNum - 1
		return ans.ask	

elseif(level>14 and level<20)then
	if(level>=15 and nTaskNum<16) then
		--if(LuaQueryTask("Tbaitan")==0) then   英文的任务标记不能在可接任务里面出现
			--ans.ask[nTaskNum]={ID="Tbaitan",name="摆摊[教程]"}
			--nTaskNum = nTaskNum + 1    
		--end
		if(LuaQueryTask("T361")==0 and level>=15 and level<18) then
			ans.ask[nTaskNum]={ID="T361",name="消灭青狼[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=16 and nTaskNum<16) then
		if(LuaQueryTask("T363")==0) then
			ans.ask[nTaskNum]={ID="T363",name="沉淀的背包[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T356")==0 and LuaQueryTask("T357")==99) then
			ans.ask[nTaskNum]={ID="T357",name="蛮夷阴谋[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T357")==0 and LuaQueryTask("T358")==99) then
			ans.ask[nTaskNum]={ID="T357",name="天下之势[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T358")==0) then
			ans.ask[nTaskNum]={ID="T358",name="桓玄之志[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T72")==0) then
			ans.ask[nTaskNum]={ID="T72",name="队伍集结[教程]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T382")==0) then
			ans.ask[nTaskNum]={ID="T382",name="清剿邪教[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T360")==0) then
			ans.ask[nTaskNum]={ID="T360",name="偷梁换柱[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T362")==0) then
			ans.ask[nTaskNum]={ID="T362",name="贴身伙伴[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T268")==0 and LuaQueryTask("T72")==99) then
			ans.ask[nTaskNum]={ID="T268",name="帮派国家[剧情]"}
			nTaskNum = nTaskNum + 1    
		end		
	end
	if(level>=17 and nTaskNum<16) then
		if(LuaQueryTask("T352")==0 and LuaQueryTask("T351")==99) then
			ans.ask[nTaskNum]={ID="T352",name="破敌之策[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T369")==0 and LuaQueryTask("T360")==99) then
			ans.ask[nTaskNum]={ID="T369",name="教徒的疑虑[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T362")==0) then
			ans.ask[nTaskNum]={ID="T362",name="贴身伙伴[剧情]"}
			nTaskNum = nTaskNum + 1    
		end		
		
	end
	if(level>=18 and nTaskNum<16) then
		if(LuaQueryTask("T392")==0 and LuaQueryTask("T391")==99) then
			ans.ask[nTaskNum]={ID="T392",name="地牢之谜[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T116")==0 and LuaQueryTask("T375")==99) then
			ans.ask[nTaskNum]={ID="T116",name="勇士之梦[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		--if(LuaQueryTask("T391")==0) then
		--	ans.ask[nTaskNum]={ID="T391",name="救治英雄[剧情]"}
			--nTaskNum = nTaskNum + 1    
		--end
		--if(LuaQueryTask("T375")==0) then
			--ans.ask[nTaskNum]={ID="T375",name="迷宫初体验[剧情]"}
			--nTaskNum = nTaskNum + 1    
		--end
		if(LuaQueryTask("T355")==0) then
			ans.ask[nTaskNum]={ID="T355",name="谢家女将[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T374")==0) then
			ans.ask[nTaskNum]={ID="T374",name="叛逆之因[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T278")==0) then
			ans.ask[nTaskNum]={ID="T278",name="巾帼授业"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T266")==0 and LuaQueryTask("T278")==99) then
			ans.ask[nTaskNum]={ID="T266",name="谢家风骨[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		--if(LuaQueryTask("T394")==0) then
			--ans.ask[nTaskNum]={ID="T394",name="地牢除恶[循环]"}
			--nTaskNum = nTaskNum + 1    
		--end
		if(LuaQueryTask("T380")==0) then
			ans.ask[nTaskNum]={ID="T380",name="天师秘术[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=19 and nTaskNum<16) then
		if(LuaQueryTask("T373")==0) then
			ans.ask[nTaskNum]={ID="T373",name="巾帼红颜[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T371")==0) then
			ans.ask[nTaskNum]={ID="T371",name="暴露身份[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T370")==0) then
			ans.ask[nTaskNum]={ID="T370",name="嗜血狂徒[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T381")==0 and LuaQueryTask("T380")==99) then
			ans.ask[nTaskNum]={ID="T381",name="夫君的下落[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T851")==0) then
			ans.ask[nTaskNum]={ID="T851",name="冤屈[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T852")==0 and LuaQueryTask("T851")==99) then
			ans.ask[nTaskNum]={ID="T852",name="前往[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T850")==0 and LuaQueryTask("T851")==99) then
			ans.ask[nTaskNum]={ID="T850",name="免罪[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T280")==0 and LuaQueryTask("T850")==99) then
			ans.ask[nTaskNum]={ID="T280",name="张贴通告[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T291")==0 and LuaQueryTask("T850")==99) then
			ans.ask[nTaskNum]={ID="T291",name="司马的报复[剧情]"}
			nTaskNum = nTaskNum + 1    
		end

	end	
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>19 and level<25)then
	if(level>=24 and nTaskNum<16) then
		if(LuaQueryTask("T403")==0) then
			ans.ask[nTaskNum]={ID="T403",name="前方军情[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T445")==0) then
			ans.ask[nTaskNum]={ID="T445",name="野蛮愚民[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T442")==0) then
			ans.ask[nTaskNum]={ID="T442",name="汇报军情[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=23 and nTaskNum<16) then

		if(LuaQueryTask("T404")==0) then
			ans.ask[nTaskNum]={ID="T404",name="大权在握[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T400")==0 and LuaQueryTask("T404") == 99) then
			ans.ask[nTaskNum]={ID="T400",name="谢玄的考验[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		--[[if(LuaQueryTask("T401")==0 and LuaQueryTask("T400")==99) then
			ans.ask[nTaskNum]={ID="T401",name="谢玄的考验2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end]]
		if(LuaQueryTask("T406")==0 and LuaQueryTask("T401") == 99) then
			ans.ask[nTaskNum]={ID="T406",name="钢铁之师[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=22 and nTaskNum<16) then
--		if(LuaQueryTask("T402")==0) then
--			ans.ask[nTaskNum]={ID="T402",name="报到[剧情]"}
--			nTaskNum = nTaskNum + 1    
--		end
		if(LuaQueryTask("T424")==0) then
			ans.ask[nTaskNum]={ID="T424",name="兵灾[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T425")==0 and LuaQueryTask("T424")==99) then
			ans.ask[nTaskNum]={ID="T425",name="兵灾2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T426")==0 and LuaQueryTask("T425")==99) then
			ans.ask[nTaskNum]={ID="T426",name="兵灾3[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=21 and nTaskNum<16) then
		if(LuaQueryTask("T290")==0) then
			ans.ask[nTaskNum]={ID="T290",name="望子成龙[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
--		if(LuaQueryTask("T855")==0) then
--			ans.ask[nTaskNum]={ID="T855",name="见钱眼开[剧情]"}
--			nTaskNum = nTaskNum + 1    
--		end
		if(LuaQueryTask("T115")==0 and LuaQueryTask("T290")==99) then
			ans.ask[nTaskNum]={ID="T115",name="父子相残[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=20 and nTaskNum<16) then
		if(LuaQueryTask("T112")==0 and LuaQueryTask("T114")==99) then
			ans.ask[nTaskNum]={ID="T112",name="父子情仇[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T395")==0 and LuaQueryTask("T393")==99) then
			ans.ask[nTaskNum]={ID="T395",name="擂台争霸[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T393")==0 and LuaQueryTask("T392")==99) then
			ans.ask[nTaskNum]={ID="T393",name="破除邪术[BOSS]"}
			nTaskNum = nTaskNum + 1    
		end
		--if(LuaQueryTask("T126")==0) then
			--ans.ask[nTaskNum]={ID="T126",name="新人推荐[教程]"}
			--nTaskNum = nTaskNum + 1    
		--end
		if(LuaQueryTask("T407")==0) then
			ans.ask[nTaskNum]={ID="T407",name="藏宝图之密[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	--	if(LuaQueryTask("T114")==0) then
			--ans.ask[nTaskNum]={ID="T114",name="纨绔子弟[剧情]"}
			--nTaskNum = nTaskNum + 1    
	--	end
		if(LuaQueryTask("T299")==0) then
			ans.ask[nTaskNum]={ID="T299",name="承包土地[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
--		if(LuaQueryTask("T124")==0) then
--			ans.ask[nTaskNum]={ID="T124",name="仁慈公主[剧情]"}
--			nTaskNum = nTaskNum + 1    
--		end
		if(LuaQueryTask("T123")==0 and LuaQueryTask("T126")==99) then
			ans.ask[nTaskNum]={ID="T123",name="北府军营[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T423")==0) then
			ans.ask[nTaskNum]={ID="T423",name="速度的考验[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T446")==0) then
			ans.ask[nTaskNum]={ID="T446",name="副本体验[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>24 and level<30)then
	if(level>=29 and nTaskNum<16) then
		if(LuaQueryTask("T477")==0 and LuaQueryTask("T476")==99) then
			ans.ask[nTaskNum]={ID="T477",name="抉择[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T473")==0) then
			ans.ask[nTaskNum]={ID="T473",name="鏖战万蛇[BOSS]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T476")==0 and LuaQueryTask("T475") == 99) then
			ans.ask[nTaskNum]={ID="T476",name="苦恼[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T475")==0) then
			ans.ask[nTaskNum]={ID="T475",name="青水虫患[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=28 and nTaskNum<16) then

		if(LuaQueryTask("T471")==0 and LuaQueryTask("T853") == 99) then
			ans.ask[nTaskNum]={ID="T471",name="鼎力相助[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T472")==0 and LuaQueryTask("T471")==99) then
			ans.ask[nTaskNum]={ID="T472",name="鼎力相助2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T474")==0 and LuaQueryTask("T471") == 99) then
			ans.ask[nTaskNum]={ID="T474",name="蛟胆炼利剑[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T853")==0) then
			ans.ask[nTaskNum]={ID="T853",name="昔日旧友[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T463")==0) then
			ans.ask[nTaskNum]={ID="T463",name="军需[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T460")==0) then
			ans.ask[nTaskNum]={ID="T460",name="渡河[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=27 and nTaskNum<16) then
		if(LuaQueryTask("T461")==0) then
			ans.ask[nTaskNum]={ID="T461",name="良药防身[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T452")==0) then
			ans.ask[nTaskNum]={ID="T452",name="物资匮乏[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T453")==0 and LuaQueryTask("T452")==99) then
			ans.ask[nTaskNum]={ID="T453",name="物资匮乏2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T450")==0) then
			ans.ask[nTaskNum]={ID="T450",name="鳄胆入药[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T451")==0 and LuaQueryTask("T450")==99) then
			ans.ask[nTaskNum]={ID="T451",name="治病良药[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=26 and nTaskNum<16) then
		if(LuaQueryTask("T462")==0) then
			ans.ask[nTaskNum]={ID="T462",name="凶残鳄鱼[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T443")==0) then
			ans.ask[nTaskNum]={ID="T443",name="北府大将[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T454")==0) then
			ans.ask[nTaskNum]={ID="T454",name="运送物资[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=25 and nTaskNum<16) then
		if(LuaQueryTask("T405")==0) then
			ans.ask[nTaskNum]={ID="T405",name="协助[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T440")==0) then
			ans.ask[nTaskNum]={ID="T440",name="提升士气[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T441")==0 and LuaQueryTask("T440")==99) then
			ans.ask[nTaskNum]={ID="T441",name="提升士气2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>29 and level<35)then
	if(level>=34 and nTaskNum<21) then
		if(LuaQueryTask("T590")==0) then
			ans.ask[nTaskNum]={ID="T590",name="压制毒素[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T581")==0) then
			ans.ask[nTaskNum]={ID="T581",name="鬼妇叔嫂[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T584")==0 and LuaQueryTask("T581")==99) then
			ans.ask[nTaskNum]={ID="T584",name="扭转乾坤[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T580")==0) then
			ans.ask[nTaskNum]={ID="T580",name="昔日往事[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=33 and nTaskNum<21) then
		if(LuaQueryTask("T587")==0) then
			ans.ask[nTaskNum]={ID="T587",name="消灭竹妖[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T570")==0) then
			ans.ask[nTaskNum]={ID="T570",name="吃斋念佛[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T506")==0) then
			ans.ask[nTaskNum]={ID="T506",name="消灭叛军[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T561")==0 and LuaQueryTask("T560")==99) then
			ans.ask[nTaskNum]={ID="T561",name="败将阴谋[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T507")==0 and LuaQueryTask("T506")==99) then
			ans.ask[nTaskNum]={ID="T507",name="收编败军[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T565")==0 and LuaQueryTask("T507")==99) then
			ans.ask[nTaskNum]={ID="T565",name="潜入竹林[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=32 and nTaskNum<21) then
		if(LuaQueryTask("T512")==0) then
			ans.ask[nTaskNum]={ID="T512",name="另觅他主[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T560")==0) then
			ans.ask[nTaskNum]={ID="T560",name="败军困扰[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T533")==0) then
			ans.ask[nTaskNum]={ID="T533",name="为民除害[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T505")==0) then
			ans.ask[nTaskNum]={ID="T505",name="探查军情[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=31 and nTaskNum<21) then
		if(LuaQueryTask("T571")==0) then
			ans.ask[nTaskNum]={ID="T571",name="疯狂的战士[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T513")==0) then
			ans.ask[nTaskNum]={ID="T513",name="十万火急[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T499")==0) then
			ans.ask[nTaskNum]={ID="T499",name="昔日枭雄[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T552")==0) then
			ans.ask[nTaskNum]={ID="T552",name="收集熊掌[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T490")==0) then
			ans.ask[nTaskNum]={ID="T490",name="苻融的考验[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=30 and nTaskNum<21) then
		if(LuaQueryTask("T191")==0) then
			ans.ask[nTaskNum]={ID="T191",name="防骗指导[教程]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T486")==0 and LuaQueryTask("T485")==99) then
			ans.ask[nTaskNum]={ID="T486",name="知恩图报[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T485")==0 and LuaQueryTask("T482")==99) then
			ans.ask[nTaskNum]={ID="T485",name="救助难民[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T470")==0 and LuaQueryTask("T472") == 99) then
			ans.ask[nTaskNum]={ID="T470",name="启程北方[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T482")==0) then
			ans.ask[nTaskNum]={ID="T482",name="医治难民[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T480")==0) then
			ans.ask[nTaskNum]={ID="T480",name="难民的悲哀[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>34 and level<40)then
	if(level>=39 and nTaskNum<21) then
		if(LuaQueryTask("T594")==0 and LuaQueryTask("T614")==99) then
			ans.ask[nTaskNum]={ID="T594",name="获救喜讯[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T613")==0) then
			ans.ask[nTaskNum]={ID="T613",name="追踪邪恶[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T614")==0) then
			ans.ask[nTaskNum]={ID="T614",name="邪恶根源[BOSS]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T612")==0) then
			ans.ask[nTaskNum]={ID="T612",name="严刑逼供[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=38 and nTaskNum<21) then
		if(LuaQueryTask("T611")==0) then
			ans.ask[nTaskNum]={ID="T611",name="压制魔性[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T610")==0) then
			ans.ask[nTaskNum]={ID="T610",name="幼子仁心[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=37 and nTaskNum<21) then
		if(LuaQueryTask("T601")==0) then
			ans.ask[nTaskNum]={ID="T601",name="救治亡魂[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T615")==0) then
			ans.ask[nTaskNum]={ID="T615",name="消灭尸虫[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T600")==0) then
			ans.ask[nTaskNum]={ID="T600",name="巫师阴谋[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T593")==0) then
			ans.ask[nTaskNum]={ID="T593",name="伏魔号角[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T582")==0) then
			ans.ask[nTaskNum]={ID="T582",name="嗜血蛮族[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=36 and nTaskNum<21) then
		if(LuaQueryTask("T597")==0 and LuaQueryTask("T595")==99) then
			ans.ask[nTaskNum]={ID="T597",name="回首往事2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T583")==0) then
			ans.ask[nTaskNum]={ID="T583",name="制作毒药[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T599")==0) then
			ans.ask[nTaskNum]={ID="T599",name="收伏苻坚[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T592")==0) then
			ans.ask[nTaskNum]={ID="T592",name="幼子线索[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=35 and nTaskNum<21) then
		if(LuaQueryTask("T595")==0) then
			ans.ask[nTaskNum]={ID="T595",name="回首往事[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T604")==0) then
			ans.ask[nTaskNum]={ID="T604",name="巫师的刁难[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T591")==0) then
			ans.ask[nTaskNum]={ID="T591",name="邪术异变[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>39 and level<45)then
	if(level>=44 and nTaskNum<21) then
		if(LuaQueryTask("T638")==0 and LuaQueryTask("T642")==99) then
			ans.ask[nTaskNum]={ID="T638",name="劝解之道[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T647")==0 and LuaQueryTask("T670")==99) then
			ans.ask[nTaskNum]={ID="T647",name="解救次子[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T630")==0) then
			ans.ask[nTaskNum]={ID="T630",name="父亲的解释[剧情]"}
			nTaskNum = nTaskNum + 1    
		end

		if(LuaQueryTask("T634")==0) then
			ans.ask[nTaskNum]={ID="T634",name="致命的误解[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=43 and nTaskNum<21) then
		if(LuaQueryTask("T500")==0) then
			ans.ask[nTaskNum]={ID="T500",name="苻坚的忠告[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T642")==0) then
			ans.ask[nTaskNum]={ID="T642",name="阴谋的后果[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T641")==0) then
			ans.ask[nTaskNum]={ID="T641",name="次子的阴谋[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T636")==0) then
			ans.ask[nTaskNum]={ID="T636",name="父子之情[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T635")==0) then
			ans.ask[nTaskNum]={ID="T635",name="清理道路[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T631")==0) then
			ans.ask[nTaskNum]={ID="T631",name="借兵[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T738")==0) then
			ans.ask[nTaskNum]={ID="T738",name="治理病人[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T737")==0) then
			ans.ask[nTaskNum]={ID="T737",name="购买药物[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T733")==0) then
			ans.ask[nTaskNum]={ID="T733",name="援助太行径[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T732")==0) then
			ans.ask[nTaskNum]={ID="T732",name="稀缺药物[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=42 and nTaskNum<21) then
		if(LuaQueryTask("T734")==0) then
			ans.ask[nTaskNum]={ID="T734",name="解馋[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T730")==0) then
			ans.ask[nTaskNum]={ID="T730",name="拓跋仁心[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T745")==0) then
			ans.ask[nTaskNum]={ID="T745",name="老翁的关怀[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T744")==0) then
			ans.ask[nTaskNum]={ID="T744",name="老翁的故事[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=41 and nTaskNum<21) then
		if(LuaQueryTask("T731")==0) then
			ans.ask[nTaskNum]={ID="T731",name="消除隐患[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T626")==0) then
			ans.ask[nTaskNum]={ID="T626",name="寻求明主[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T625")==0) then
			ans.ask[nTaskNum]={ID="T625",name="文艺复兴[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T743")==0) then
			ans.ask[nTaskNum]={ID="T743",name="狩猎[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T624")==0) then
			ans.ask[nTaskNum]={ID="T624",name="鲜卑皇室[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=40 and nTaskNum<21) then
		if(LuaQueryTask("T621")==0 and LuaQueryTask("T622")==99) then
			ans.ask[nTaskNum]={ID="T621",name="统一之道2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T622")==0) then
			ans.ask[nTaskNum]={ID="T622",name="统一之道1[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		--if(LuaQueryTask("T627")==0) then
			--ans.ask[nTaskNum]={ID="T627",name="消灭夜叉[循环]"}
			--nTaskNum = nTaskNum + 1    
		--end
		if(LuaQueryTask("T620")==0) then
			ans.ask[nTaskNum]={ID="T620",name="高人教诲[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>44 and level<50)then
	if(level>=49 and nTaskNum<21) then
		if(LuaQueryTask("T655")==0) then
			ans.ask[nTaskNum]={ID="T655",name="山中之王[BOSS]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=48 and nTaskNum<21) then
		if(LuaQueryTask("T654")==0) then
			ans.ask[nTaskNum]={ID="T654",name="绿石之魂[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T653")==0) then
			ans.ask[nTaskNum]={ID="T653",name="物资收集[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=47 and nTaskNum<21) then
		if(LuaQueryTask("T656")==0) then
			ans.ask[nTaskNum]={ID="T656",name="匡扶正义[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T751")==0) then
			ans.ask[nTaskNum]={ID="T751",name="鏖战草原[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T736")==0) then
			ans.ask[nTaskNum]={ID="T736",name="义助崔宏[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end

	if(level>=45 and nTaskNum<21) then
		if(LuaQueryTask("T651")==0) then
			ans.ask[nTaskNum]={ID="T651",name="阴谋的真相[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T644")==0 and LuaQueryTask("T645")==99) then
			ans.ask[nTaskNum]={ID="T644",name="父子和睦[剧情]"}
			nTaskNum = nTaskNum + 1    
		end

		if(LuaQueryTask("T645")==0) then
			ans.ask[nTaskNum]={ID="T645",name="负荆请罪[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T649")==0) then
			ans.ask[nTaskNum]={ID="T649",name="次子的安危[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T648")==0) then
			ans.ask[nTaskNum]={ID="T648",name="次子的关怀[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T639")==0) then
			ans.ask[nTaskNum]={ID="T639",name="乱民的威胁[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T637")==0) then
			ans.ask[nTaskNum]={ID="T637",name="援助石越[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T633")==0) then
			ans.ask[nTaskNum]={ID="T633",name="筹措战备[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>49 and level<55)then
	if(level>=54 and nTaskNum<21) then
		if(LuaQueryTask("T691")==0) then
			ans.ask[nTaskNum]={ID="T691",name="商榷[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T690")==0) then
			ans.ask[nTaskNum]={ID="T690",name="慕容垂之诺[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=53 and nTaskNum<21) then
		if(LuaQueryTask("T670")==0) then
			ans.ask[nTaskNum]={ID="T670",name="过河拆桥[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T681")==0) then
			ans.ask[nTaskNum]={ID="T681",name="消灭妖兵[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T692")==0) then
			ans.ask[nTaskNum]={ID="T692",name="忠心侍者[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=52 and nTaskNum<21) then
		if(LuaQueryTask("T672")==0 and LuaQueryTask("T671")==99) then
			ans.ask[nTaskNum]={ID="T672",name="栽培2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T671")==0) then
			ans.ask[nTaskNum]={ID="T671",name="栽培1[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=51 and nTaskNum<21) then
		if(LuaQueryTask("T663")==0) then
			ans.ask[nTaskNum]={ID="T663",name="亲试妖兵[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		--[[if(LuaQueryTask("T660")==0) then   ---此系列任务存在严重逻辑问题,请慎重去掉注释
			ans.ask[nTaskNum]={ID="T660",name="仅存的良知[剧情]"}
			nTaskNum = nTaskNum + 1    
		end]]
	end
	if(level>=50 and nTaskNum<21) then
		if(LuaQueryTask("T664")==0) then
			ans.ask[nTaskNum]={ID="T664",name="浑后的责难[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T662")==0) then
			ans.ask[nTaskNum]={ID="T662",name="冷血生母[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T661")==0) then
			ans.ask[nTaskNum]={ID="T661",name="失败的献祭[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T646")==0) then
			ans.ask[nTaskNum]={ID="T646",name="博取信任[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask

elseif(level>54 and level<60)then
	if(level>=59 and nTaskNum<21) then
		if(LuaQueryTask("T714")==0) then
			ans.ask[nTaskNum]={ID="T714",name="地下的决战[BOSS]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T750")==0) then
			ans.ask[nTaskNum]={ID="T750",name="最后的挑战[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T713")==0) then
			ans.ask[nTaskNum]={ID="T713",name="谨慎行事[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=57 and nTaskNum<21) then
		if(LuaQueryTask("T712")==0) then
			ans.ask[nTaskNum]={ID="T712",name="战前考验[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=56 and nTaskNum<21) then
		if(LuaQueryTask("T711")==0) then
			ans.ask[nTaskNum]={ID="T711",name="王陵灭怪2[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=55 and nTaskNum<21) then
		if(LuaQueryTask("T735")==0) then
			ans.ask[nTaskNum]={ID="T735",name="粥济难民[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T715")==0) then
			ans.ask[nTaskNum]={ID="T715",name="消灭僵尸[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T710")==0) then
			ans.ask[nTaskNum]={ID="T710",name="王陵灭怪1[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T680")==0) then
			ans.ask[nTaskNum]={ID="T680",name="守墓老人[剧情]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask
elseif(level>60 and level<70)then
	if(level>=68 and nTaskNum<21) then

		if(LuaQueryTask("T840")==0) then
			ans.ask[nTaskNum]={ID="T840",name="沙漠之花[循环]"}
			nTaskNum = nTaskNum + 1    
		end	
	end
	if(level>=66 and nTaskNum<21) then
		if(LuaQueryTask("T831")==0) then
			ans.ask[nTaskNum]={ID="T831",name="军事储水[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T830")==0) then
			ans.ask[nTaskNum]={ID="T830",name="收集军资[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T841")==0) then
			ans.ask[nTaskNum]={ID="T841",name="沙漠清剿[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=65 and nTaskNum<21) then
		if(LuaQueryTask("T821")==0) then
			ans.ask[nTaskNum]={ID="T821",name="屠狼[循环]"}
			nTaskNum = nTaskNum + 1    
		end	
	end
	if(level>=64 and level<=65 and nTaskNum<21) then
		if(LuaQueryTask("T820")==0) then
			ans.ask[nTaskNum]={ID="T820",name="消灭战争兽[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=63 and nTaskNum<21) then
		if(LuaQueryTask("T810")==0) then
			ans.ask[nTaskNum]={ID="T810",name="斗止兵戈[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T801")==0) then
			ans.ask[nTaskNum]={ID="T801",name="储备粮食[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
	if(level>=61 and nTaskNum<21 and level<63) then

		if(LuaQueryTask("T800")==0) then
			ans.ask[nTaskNum]={ID="T800",name="平息兵乱[循环]"}
			nTaskNum = nTaskNum + 1    
		end
		if(LuaQueryTask("T811")==0) then
			ans.ask[nTaskNum]={ID="T811",name="储备军粮[循环]"}
			nTaskNum = nTaskNum + 1    
		end
	end
		ans.count = nTaskNum - 1
		return ans.ask
elseif(level>70 and level<80)then
		if(level>=77 and nTaskNum<21)then
			if(LuaQueryTask("T961")==0)then
				ans.ask[nTaskNum]={ID="T961",name="萨满必死【循环】"}
				nTaskNum = nTaskNum + 1 
			end
			if(LuaQueryTask("T951")==0)then
				ans.ask[nTaskNum]={ID="T951",name="变种剑蜥【循环】"}
				nTaskNum = nTaskNum + 1 
			end
		end
		if(level>=76 and nTaskNum<21)then
			if(LuaQueryTask("T960")==0)then
				ans.ask[nTaskNum]={ID="T960",name="匈奴力士【循环】"}
				nTaskNum = nTaskNum + 1 
			end
		end

		if(level>=75 and nTaskNum<21)then
			if(LuaQueryTask("T950")==0)then
				ans.ask[nTaskNum]={ID="T950",name="消灭獠龙【循环】"}
				nTaskNum = nTaskNum + 1 
			end
		end
		if(level>=72 and nTaskNum<21)then
			if(LuaQueryTask("T901")==0)then
				ans.ask[nTaskNum]={ID="T901",name="天师邪灵【循环】"}
				nTaskNum = nTaskNum + 1 
			end
			if(LuaQueryTask("T861")==0)then
				ans.ask[nTaskNum]={ID="T861",name="去除威胁【循环】"}
				nTaskNum = nTaskNum + 1 
			end
		end
		if(level>=71 and nTaskNum<21)then
			if(LuaQueryTask("T900")==0)then
				ans.ask[nTaskNum]={ID="T900",name="邪恶拳将【循环】"}
				nTaskNum = nTaskNum + 1 
			end
			if(LuaQueryTask("T860")==0)then
				ans.ask[nTaskNum]={ID="T860",name="偷金贼【循环】"}
				nTaskNum = nTaskNum + 1 
			end
		end
		ans.count = nTaskNum - 1
		return ans.ask


end
return ans.ask
end